_posts/2021-10-16-java_serviceloader.html
---
layout: blogpost
title: Java ServiceLoader - The super simple "dependency injection"ish feature you may not know about!
tags: java programming
---

<p>
ServiceLoader (aka Service Provider) is a feature that has been in Java since Java 1.3, but many people still don't know about it. The reason I think most people don't know about it, is that they use various dependency injection frameworks for the same kinds of problems. ServiceLoader can supplement these kinds of problems, or be used in addition to them, you decide based upon the problem you are solving. Think of ServiceLoader as another tool in your toolbox. Some people like to think of it as a built in very simplistic dependency injection system.
</p>


<div id="outline-container-orgdd9ccc2" class="outline-2">
<h2 id="orgdd9ccc2">Simple example: A service with a single implementation</h2>
<div class="outline-text-2" id="text-orgdd9ccc2">
<p>
Let's start with the most simple example possible to show the basic functionality. Later we will see a more useful example, but it's always useful to see the complete basics first. 
</p>


<p>
The first step is to create an interface:
</p>

<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.simple;

public interface Service {
    void sayHello();
}
</pre>
</div>


<p>
Interfaces are not useful without an implementation, so let's create one:
</p>

<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.simple;

public class ServiceImpl implements Service {
    @Override
    public void sayHello() {
	System.out.println("Hello!");
    }
}
</pre>
</div>

<p>
Now, what's the next step for the ServiceLoader functionality to work? We have to create a file specifying which implementations exist for the interface we want to load. This file needs to have the same name as the package and name of the interface and reside in the <code>=src/main/resources/META-INF/services=</code>-directory. In our example this will be <code>src/resources/META-INF/services/net.themkat.serviceloader.demo.simple.Service</code>. The contents will be the fully qualified name (name including package) of the implementation classes, in our example only our implementation class from above:
</p>

<div class="org-src-container">
<pre class="src src-text">net.themkat.serviceloader.demo.simple.ServiceImpl
</pre>
</div>

<p>
Now we can load our implementation class using the ServiceLoader functionality:
</p>

<div class="org-src-container">
<pre class="src src-java">ServiceLoader&lt;Service&gt; loader = ServiceLoader.load(Service.class);
Service myService = loader.findFirst().orElse(null);
myService.sayHello();
</pre>
</div>


<p>
Now this is pretty simple, but shows the basic mechanics of a "dynamic" loading of the implementation class without hardcoding it (loose coupling, yay!). Wouldn't it be fun to extend it with more implementation classes? &#x2026;
</p>
</div>
</div>


<div id="outline-container-orgff56a1f" class="outline-2">
<h2 id="orgff56a1f">Taking it a bit further: CurrencyProvider</h2>
<div class="outline-text-2" id="text-orgff56a1f">
<p>
Let's go a step further with another toy example, that may seem a little bit more useful, and show what ServiceProvider is capable of. CurrencyProvider will be an interface for services/implementations providing the default currency for the area they are in. We will create implementations for Norway, EU and the US. In the real world, this might be a little more advanced (using real ISO standard country codes consistently etc.), but let's keep it simple for the sake of the example.
</p>


<p>
The first part is off course creating the interface, which will be a little more advanced this time:
</p>
<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.currency;

import java.util.Iterator;
import java.util.ServiceLoader;

public interface CurrencyProvider {
    // the method we use the provider for
    // Returns the official currency of the country it is implemented for
    String currencyCode();

    // helper for our serviceloader code below
    boolean supportsCountry(String countryCode);

    // serviceloader code that fetches an implementation
    // (without the interface needing to know about the implementations!)
    static CurrencyProvider getCurrencyProvider(String countryCode) {
	ServiceLoader&lt;CurrencyProvider&gt; loader = ServiceLoader.load(CurrencyProvider.class);
	Iterator&lt;CurrencyProvider&gt; iterator = loader.iterator();
	while (iterator.hasNext()) {
	    CurrencyProvider provider = iterator.next();
	    if (provider.supportsCountry(countryCode)) {
		return provider;
	    }
	}

	// return null for simplicity.
	// We could also return a default implementation, or throw an exception of some kind
	return null;
    }
}
</pre>
</div>

<p>
There are comments in-line explaining each section, but the most important addition this time is the helper-method supportsCountry and the method to fetch an implementation (a static method in the interface, something that has been allowed since Java 8). Here we isolate the fetching of the implementation to the interface, so no other parts of the code need to do the ServiceLoader implementations. They only need to call <code>CurrencyProvider.getCurrencyProvider</code> with a country code of their choice. This makes the code needing to fetch a currency based upon a country quite short and clean.
</p>

<p>
We will create three implementations. First out, CurrencyProvider for Norway:
</p>
<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.currency.impl;

import net.themkat.serviceloader.demo.currency.CurrencyProvider;

public class NorwayCurrencyProvider implements CurrencyProvider {

    @Override
    public String currencyCode() {
	return "NOK";
    }

    @Override
    public boolean supportsCountry(String countryCode) {
	return "NO".equals(countryCode);
    }    
}
</pre>
</div>

<p>
Next out, CurrencyProvider for the EU:
</p>
<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.currency.impl;

import net.themkat.serviceloader.demo.currency.CurrencyProvider;

public class EUCurrencyProvider implements CurrencyProvider {

    @Override
    public String currencyCode() {
	return "EU";
    }

    @Override
    public boolean supportsCountry(String countryCode) {
	// add EU countries. Just adding a few I remember off my head
	return "FRA".equals(countryCode) || "DEU".equals(countryCode) ||
	    "BEL".equals(countryCode) || "ITA".equals(countryCode);
    }    
}
</pre>
</div>

<p>
Last out, our CurrencyProvider for the US:
</p>
<div class="org-src-container">
<pre class="src src-java">package net.themkat.serviceloader.demo.currency.impl;

import net.themkat.serviceloader.demo.currency.CurrencyProvider;

public class USCurrencyProvider implements CurrencyProvider {

    @Override
    public String currencyCode() {
	return "USD";
    }

    @Override
    public boolean supportsCountry(String countryCode) {
	return "US".equals(countryCode);
    } 
}
</pre>
</div>

<p>
Now we have a few implementation classes to play with, so let's create our service information file <code>src/main/resources/META-INF/services/net.themkat.serviceloader.demo.currency.CurrencyProvider</code>:
</p>
<div class="org-src-container">
<pre class="src src-text">net.themkat.serviceloader.demo.currency.impl.NorwayCurrencyProvider
net.themkat.serviceloader.demo.currency.impl.EUCurrencyProvider
net.themkat.serviceloader.demo.currency.impl.USCurrencyProvider
</pre>
</div>

<p>
We can now try to fetch some implementations:
</p>
<div class="org-src-container">
<pre class="src src-java">System.out.println("Norway currency: " + CurrencyProvider.getCurrencyProvider("NO").currencyCode());
System.out.println("EU currency: " + CurrencyProvider.getCurrencyProvider("ITA").currencyCode());
System.out.println("US currency: " + CurrencyProvider.getCurrencyProvider("US").currencyCode());
System.out.println("Unknown currency: " + CurrencyProvider.getCurrencyProvider("XX").currencyCode());
</pre>
</div>

<p>
The last line will cause a null pointer, so in a real world code base you should probably use a default/dummy implementation instead (which can be hardcoded in your code, and does not need to be in the meta-inf services file!). Or at least some null checking, but that is probably common sense if you have programmed in Java beyond basic examples. You can make a default implementation as a fun exercise to play with the concept if you like :)
</p>


<p>
You can also use other data types like enums, or make the loading of implementations as simple or complex as you like. The limit here is your imagination! (or at least close)
</p>
</div>
</div>


<div id="outline-container-orgf7fe701" class="outline-2">
<h2 id="orgf7fe701">Making it simpler: Maven plugin</h2>
<div class="outline-text-2" id="text-orgf7fe701">
<p>
Maybe you have a big project with many implementations to a service? Or you just hate creating the text files describing implementations. There is (shockingly not) a Maven plugin for that! With this Maven plugin you can generate the services files. Let's see how that would look for our CurrencyProvider example above:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;build&gt;
    &lt;plugins&gt;
	&lt;plugin&gt;
	    &lt;groupId&gt;eu.somatik.serviceloader-maven-plugin&lt;/groupId&gt;
	    &lt;artifactId&gt;serviceloader-maven-plugin&lt;/artifactId&gt;
	    &lt;version&gt;1.3.1&lt;/version&gt;
	    &lt;configuration&gt;
		&lt;services&gt;
		    &lt;param&gt;net.themkat.serviceloader.demo.currency.CurrencyProvider&lt;/param&gt;
		&lt;/services&gt;
	    &lt;/configuration&gt;
	    &lt;executions&gt;
		&lt;execution&gt;
		    &lt;goals&gt;
			&lt;goal&gt;generate&lt;/goal&gt;
		    &lt;/goals&gt;
		&lt;/execution&gt;
	    &lt;/executions&gt;
	&lt;/plugin&gt;
    &lt;/plugins&gt;
&lt;/build&gt;
</pre>
</div>


<p>
<b>NB! you should probably delete the old file we created manually above first!</b>
</p>

<p>
Pretty simple! With this plugin you can add new implementation with ease, and not get any issues if you forget any "manual additions" beyond the implementation class. If we create a JapanCurrencyProvider or similar, we don't need any manual additions, the plugin will add it automatically for us. Neat!
</p>


<p>
There are more functionality you might want to check out for this plugin, so check out the documentation at <a href="https://github.com/francisdb/serviceloader-maven-plugin">the projects Github repo</a>.
</p>


<p>
Want to get better at using Maven from the command line? Feel free to <a href="https://themkat.net/2021/10/11/become_a_maven_ninja.html">check out my earlier Maven ninja article!</a>
</p>
</div>
</div>

<div id="outline-container-orgf42d977" class="outline-2">
<h2 id="orgf42d977">Final remarks</h2>
<div class="outline-text-2" id="text-orgf42d977">
<p>
Maybe you are still unsure what kind of problems to use it for? Here are a few examples:
</p>
<ul class="org-ul">
<li>Very simplistic dependency injection</li>
<li>Language specific implementations (tax rules, currency, social security numbers etc.)</li>
<li>Other parameter based implementations (tax rules based upon age, credit scores based upon age in countries where appropriate, etc.)</li>
<li>Use system properties or something else to load different implementations at run-time. (Same implementation as the previous bullet point, just send in the System.getProperty or similar result into the method used to fetch the implementation)</li>
</ul>


<p>
Some of you may wonder why we should not use something like Spring to do the above?
</p>
<ul class="org-ul">
<li>More light-weight. Spring and other dependency injection engines often load implementations at run time and scan packages. SeriveLoader does not, as it simply loads implementations from a file (generated at compile time)</li>
<li>No need to load additional dependencies if not necessary</li>
</ul>



<p>
As always, you should have <a href="https://docs.oracle.com/javase/8/docs/api/java/util/ServiceLoader.html">the API docs</a> handy (as you would with all other Java libraries you use!). 
</p>


<p>
Hope that made ServiceLoader (aka Service Provider) more easy to understand for some of you. Remember that you can use this from Kotlin and other JVM languages as well. If something was not clear, feel free to ask a question in the comment section!
</p>
</div>
</div>
